<!-- add-pr-comment:add-pr-comment -->

## Terraform auth0 (operations-engineering) plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # auth0_attack_protection.attack_protection will be created
  + resource "auth0_attack_protection" "attack_protection" {
      + id = (known after apply)

      + breached_password_detection {
          + admin_notification_frequency = (known after apply)
          + enabled                      = false
          + method                       = "standard"
          + shields                      = (known after apply)

          + pre_user_registration {
              + shields = (known after apply)
            }
        }

      + brute_force_protection {
          + allowlist    = (known after apply)
          + enabled      = true
          + max_attempts = 10
          + mode         = "count_per_identifier_and_ip"
          + shields      = [
              + "block",
              + "user_notification",
            ]
        }

      + suspicious_ip_throttling {
          + allowlist = (known after apply)
          + enabled   = true
          + shields   = [
              + "admin_notification",
              + "block",
            ]

          + pre_login {
              + max_attempts = 100
              + rate         = 864000
            }

          + pre_user_registration {
              + max_attempts = 50
              + rate         = 1200
            }
        }
    }

  # auth0_client.dockersso will be created
  + resource "auth0_client" "dockersso" {
      + allowed_clients                       = []
      + allowed_logout_urls                   = []
      + allowed_origins                       = []
      + app_type                              = "regular_web"
      + callbacks                             = [
          + "https://login.docker.com/login/callback?connection=samlp-ministryofjustice",
        ]
      + client_aliases                        = []
      + client_id                             = (known after apply)
      + cross_origin_auth                     = false
      + custom_login_page_on                  = true
      + description                           = "This enables Auth0 SSO via Github to login to Docker."
      + grant_types                           = [
          + "authorization_code",
          + "implicit",
          + "refresh_token",
          + "client_credentials",
        ]
      + id                                    = (known after apply)
      + is_first_party                        = true
      + is_token_endpoint_ip_header_trusted   = false
      + name                                  = "DockerSSO"
      + oidc_conformant                       = true
      + require_pushed_authorization_requests = false
      + signing_keys                          = (sensitive value)
      + sso                                   = false
      + sso_disabled                          = false
      + web_origins                           = []

      + addons {
        }

      + jwt_configuration {
          + alg                 = "RS256"
          + lifetime_in_seconds = 36000
          + secret_encoded      = false
        }

      + native_social_login {
          + apple {
              + enabled = false
            }
          + facebook {
              + enabled = false
            }
        }

      + refresh_token {
          + expiration_type              = "non-expiring"
          + idle_token_lifetime          = 2592000
          + infinite_idle_token_lifetime = true
          + infinite_token_lifetime      = true
          + leeway                       = 0
          + rotation_type                = "non-rotating"
          + token_lifetime               = 31557600
        }
    }

  # auth0_client.find_a_github_repository_owner will be created
  + resource "auth0_client" "find_a_github_repository_owner" {
      + allowed_logout_urls                   = [
          + "https://find-a-github-repository-owner-dev.cloud-platform.service.justice.gov.uk/",
        ]
      + app_type                              = "regular_web"
      + callbacks                             = [
          + "https://find-a-github-repository-owner-dev.cloud-platform.service.justice.gov.uk/auth/callback",
        ]
      + client_id                             = (known after apply)
      + cross_origin_auth                     = false
      + custom_login_page_on                  = true
      + description                           = "This secures the web application to MoJ employees"
      + grant_types                           = [
          + "authorization_code",
          + "implicit",
          + "refresh_token",
          + "client_credentials",
        ]
      + id                                    = (known after apply)
      + is_first_party                        = true
      + is_token_endpoint_ip_header_trusted   = false
      + name                                  = "Find a GitHub Repository Owner Dev"
      + oidc_conformant                       = true
      + organization_require_behavior         = "no_prompt"
      + require_pushed_authorization_requests = false
      + signing_keys                          = (sensitive value)
      + sso                                   = false
      + sso_disabled                          = false
      + web_origins                           = [
          + "https://find-a-github-repository-owner-dev.cloud-platform.service.justice.gov.uk/",
        ]

      + jwt_configuration {
          + alg                 = "RS256"
          + lifetime_in_seconds = 35994
          + secret_encoded      = false
        }

      + native_social_login {
          + apple {
              + enabled = false
            }
          + facebook {
              + enabled = false
            }
        }

      + refresh_token {
          + expiration_type              = "non-expiring"
          + idle_token_lifetime          = 2592000
          + infinite_idle_token_lifetime = true
          + infinite_token_lifetime      = true
          + leeway                       = 0
          + rotation_type                = "non-rotating"
          + token_lifetime               = 31557600
        }
    }

  # auth0_client.github will be created
  + resource "auth0_client" "github" {
      + allowed_clients                       = []
      + allowed_logout_urls                   = []
      + allowed_origins                       = []
      + app_type                              = "regular_web"
      + callbacks                             = [
          + "https://github.com/orgs/ministryofjustice/saml/consume",
          + "https://github.com/orgs/moj-analytical-services/saml/consume",
        ]
      + client_aliases                        = []
      + client_id                             = (known after apply)
      + cross_origin_auth                     = true
      + custom_login_page_on                  = true
      + description                           = "Web application to SSO into ministryofjustice or moj-analytical-services GitHub Organisations"
      + grant_types                           = [
          + "authorization_code",
          + "implicit",
          + "refresh_token",
          + "client_credentials",
        ]
      + id                                    = (known after apply)
      + is_first_party                        = true
      + is_token_endpoint_ip_header_trusted   = false
      + name                                  = "GitHub"
      + oidc_conformant                       = true
      + organization_require_behavior         = "no_prompt"
      + require_pushed_authorization_requests = false
      + signing_keys                          = (sensitive value)
      + sso                                   = false
      + sso_disabled                          = false
      + web_origins                           = []

      + addons {
          + samlp {
              + create_upn_claim                   = true
              + digest_algorithm                   = "sha256"
              + include_attribute_name_format      = true
              + lifetime_in_seconds                = 3600
              + map_identities                     = false
              + map_unknown_claims_as_is           = false
              + mappings                           = {
                  + "email"   = "emails"
                  + "name"    = "full_name"
                  + "user_id" = "http://schemas.xmlsoap.org/ws/2005/05/identity/claims/nameidentifier"
                }
              + name_identifier_format             = "urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified"
              + name_identifier_probes             = [
                  + "http://schemas.xmlsoap.org/ws/2005/05/identity/claims/nameidentifier",
                ]
              + passthrough_claims_with_no_mapping = false
              + signature_algorithm                = "rsa-sha256"
              + typed_attributes                   = true
            }
        }

      + jwt_configuration {
          + alg                 = "RS256"
          + lifetime_in_seconds = 36000
          + secret_encoded      = false
        }

      + native_social_login {
          + apple {
              + enabled = false
            }
          + facebook {
              + enabled = false
            }
        }

      + refresh_token {
          + expiration_type              = "non-expiring"
          + idle_token_lifetime          = 2592000
          + infinite_idle_token_lifetime = true
          + infinite_token_lifetime      = true
          + leeway                       = 0
          + rotation_type                = "non-rotating"
          + token_lifetime               = 31557600
        }
    }

  # auth0_client.kpi_dashboard will be created
  + resource "auth0_client" "kpi_dashboard" {
      + allowed_clients                       = []
      + allowed_logout_urls                   = []
      + allowed_origins                       = []
      + app_type                              = "regular_web"
      + callbacks                             = [
          + "https://kpi-dashboard.cloud-platform.service.justice.gov.uk/oidc/idp/callback",
          + "http://0.0.0.0:4567/oidc/idp/callback",
          + "http://localhost:4567/oidc/idp/callback",
          + "http://127.0.0.1:4567/oidc/idp/callback",
        ]
      + client_aliases                        = []
      + client_id                             = (known after apply)
      + cross_origin_auth                     = false
      + custom_login_page_on                  = true
      + description                           = "This enables GitHub SSO login to the KPI Dashboard."
      + grant_types                           = [
          + "authorization_code",
          + "implicit",
          + "refresh_token",
        ]
      + id                                    = (known after apply)
      + is_first_party                        = true
      + is_token_endpoint_ip_header_trusted   = false
      + name                                  = "KPI Dashboard"
      + oidc_conformant                       = true
      + require_pushed_authorization_requests = false
      + signing_keys                          = (sensitive value)
      + sso                                   = false
      + sso_disabled                          = false
      + web_origins                           = [
          + "https://kpi-dashboard.cloud-platform.service.justice.gov.uk",
          + "http://0.0.0.0:4567",
          + "http://localhost:4567",
          + "http://127.0.0.1:4567",
        ]

      + jwt_configuration {
          + alg                 = "RS256"
          + lifetime_in_seconds = 36000
          + secret_encoded      = false
        }

      + native_social_login {
          + apple {
              + enabled = false
            }
          + facebook {
              + enabled = false
            }
        }

      + refresh_token {
          + expiration_type              = "non-expiring"
          + idle_token_lifetime          = 1296000
          + infinite_idle_token_lifetime = true
          + infinite_token_lifetime      = true
          + leeway                       = 0
          + rotation_type                = "non-rotating"
          + token_lifetime               = 2592000
        }
    }

  # auth0_client.pagerduty will be created
  + resource "auth0_client" "pagerduty" {
      + allowed_clients                       = []
      + allowed_logout_urls                   = []
      + allowed_origins                       = []
      + app_type                              = "sso_integration"
      + callbacks                             = [
          + "https://moj-digital-tools.pagerduty.com/sso/saml/consume",
        ]
      + client_aliases                        = []
      + client_id                             = (known after apply)
      + cross_origin_auth                     = false
      + custom_login_page_on                  = true
      + description                           = "This enables Auth0 SSO via GitHub to login to PagerDuty."
      + grant_types                           = [
          + "authorization_code",
          + "implicit",
          + "refresh_token",
          + "client_credentials",
        ]
      + id                                    = (known after apply)
      + is_first_party                        = true
      + is_token_endpoint_ip_header_trusted   = false
      + name                                  = "PagerDuty"
      + oidc_conformant                       = true
      + require_pushed_authorization_requests = false
      + signing_keys                          = (sensitive value)
      + sso                                   = false
      + sso_disabled                          = false
      + web_origins                           = []

      + addons {
          + samlp {
              + audience                           = "https://moj-digital-tools.pagerduty.com"
              + create_upn_claim                   = true
              + digest_algorithm                   = "sha1"
              + include_attribute_name_format      = true
              + lifetime_in_seconds                = 3600
              + map_identities                     = true
              + map_unknown_claims_as_is           = false
              + name_identifier_format             = "urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress"
              + name_identifier_probes             = [
                  + "http://schemas.xmlsoap.org/ws/2005/05/identity/claims/emailaddress",
                ]
              + passthrough_claims_with_no_mapping = true
              + sign_response                      = false
              + signature_algorithm                = "rsa-sha1"
              + typed_attributes                   = true

              + logout {
                  + slo_enabled = true
                }
            }
          + sso_integration {
              + name = "pagerduty"
            }
        }

      + jwt_configuration {
          + alg                 = "RS256"
          + lifetime_in_seconds = 36000
          + secret_encoded      = false
        }

      + refresh_token {
          + expiration_type              = "non-expiring"
          + idle_token_lifetime          = 1296000
          + infinite_idle_token_lifetime = true
          + infinite_token_lifetime      = true
          + leeway                       = 0
          + rotation_type                = "non-rotating"
          + token_lifetime               = 2592000
        }
    }

  # auth0_client.standards_report will be created
  + resource "auth0_client" "standards_report" {
      + allowed_clients                       = []
      + allowed_logout_urls                   = [
          + "http://127.0.0.1:4567",
          + "http://127.0.0.1/",
          + "http://localhost:4567",
          + "http://localhost",
          + "http://operations-engineering-reports.cloud-platform.service.justice.gov.uk",
          + "http://operations-engineering-reports-dev.cloud-platform.service.justice.gov.uk",
          + "http://operations-engineering-reports-prod.cloud-platform.service.justice.gov.uk",
        ]
      + allowed_origins                       = []
      + app_type                              = "regular_web"
      + callbacks                             = [
          + "http://127.0.0.1:4567/callback",
          + "http://127.0.0.1:4567/auth/callback",
          + "http://localhost:4567/auth/callback",
          + "https://localhost:4567/auth/callback",
          + "http://127.0.0.1/callback",
          + "http://localhost:4567/callback",
          + "http://localhost/callback",
          + "http://operations-engineering-reports.cloud-platform.service.justice.gov.uk/callback",
          + "http://operations-engineering-reports-dev.cloud-platform.service.justice.gov.uk/callback",
          + "http://operations-engineering-reports-prod.cloud-platform.service.justice.gov.uk/callback",
        ]
      + client_aliases                        = []
      + client_id                             = (known after apply)
      + cross_origin_auth                     = false
      + custom_login_page_on                  = true
      + description                           = "This enables login via GitHub SSO to the Standards Report: https://operations-engineering-reports.cloud-platform.service.justice.gov.uk/"
      + grant_types                           = [
          + "authorization_code",
          + "implicit",
          + "refresh_token",
        ]
      + id                                    = (known after apply)
      + is_first_party                        = true
      + is_token_endpoint_ip_header_trusted   = false
      + name                                  = "Standards Report"
      + oidc_conformant                       = true
      + require_pushed_authorization_requests = false
      + signing_keys                          = (sensitive value)
      + sso                                   = false
      + sso_disabled                          = false
      + web_origins                           = [
          + "http://127.0.0.1:4567",
          + "http://localhost:4567",
          + "http://localhost",
          + "http://127.0.0.1/",
          + "http://operations-engineering-reports.cloud-platform.service.justice.gov.uk",
          + "http://operations-engineering-reports-dev.cloud-platform.service.justice.gov.uk",
          + "http://operations-engineering-reports-prod.cloud-platform.service.justice.gov.uk",
        ]

      + jwt_configuration {
          + alg                 = "RS256"
          + lifetime_in_seconds = 36000
          + secret_encoded      = false
        }

      + native_social_login {
          + apple {
              + enabled = false
            }
          + facebook {
              + enabled = false
            }
        }

      + refresh_token {
          + expiration_type              = "non-expiring"
          + idle_token_lifetime          = 1296000
          + infinite_idle_token_lifetime = true
          + infinite_token_lifetime      = true
          + leeway                       = 0
          + rotation_type                = "non-rotating"
          + token_lifetime               = 2592000
        }
    }

  # auth0_client.terraform_provider_auth0 will be created
  + resource "auth0_client" "terraform_provider_auth0" {
      + allowed_clients                       = []
      + allowed_logout_urls                   = []
      + allowed_origins                       = []
      + app_type                              = "non_interactive"
      + callbacks                             = []
      + client_aliases                        = []
      + client_id                             = (known after apply)
      + cross_origin_auth                     = false
      + custom_login_page_on                  = true
      + description                           = "This enables Terraform to manage Auth0 in code via the operations-engineering repository."
      + grant_types                           = [
          + "client_credentials",
        ]
      + id                                    = (known after apply)
      + is_first_party                        = true
      + is_token_endpoint_ip_header_trusted   = false
      + name                                  = "Terraform Provider Auth0"
      + oidc_conformant                       = true
      + require_pushed_authorization_requests = false
      + signing_keys                          = (sensitive value)
      + sso                                   = false
      + sso_disabled                          = false
      + web_origins                           = []

      + jwt_configuration {
          + alg                 = "RS256"
          + lifetime_in_seconds = 36000
          + secret_encoded      = false
        }

      + refresh_token {
          + expiration_type              = "non-expiring"
          + idle_token_lifetime          = 2592000
          + infinite_idle_token_lifetime = true
          + infinite_token_lifetime      = true
          + leeway                       = 0
          + rotation_type                = "non-rotating"
          + token_lifetime               = 31557600
        }
    }

  # auth0_guardian.guardian will be created
  + resource "auth0_guardian" "guardian" {
      + email         = false
      + id            = (known after apply)
      + otp           = false
      + policy        = "never"
      + recovery_code = false

      + duo {
          + enabled = false
        }

      + phone {
          + enabled       = false
          + message_types = []
        }

      + push {
          + enabled = false
        }

      + webauthn_platform {
          + enabled                  = false
          + override_relying_party   = false
          + relying_party_identifier = (known after apply)
        }

      + webauthn_roaming {
          + enabled                  = false
          + override_relying_party   = false
          + relying_party_identifier = (known after apply)
          + user_verification        = (known after apply)
        }
    }

  # auth0_resource_server.auth0_management_api will be created
  + resource "auth0_resource_server" "auth0_management_api" {
      + allow_offline_access                            = false
      + enforce_policies                                = (known after apply)
      + id                                              = (known after apply)
      + identifier                                      = "https://operations-engineering.eu.auth0.com/api/v2/"
      + name                                            = "Auth0 Management API"
      + signing_alg                                     = "RS256"
      + signing_secret                                  = (known after apply)
      + skip_consent_for_verifiable_first_party_clients = false
      + token_lifetime                                  = 360
      + token_lifetime_for_web                          = 7200
    }

  # auth0_tenant.tenant will be created
  + resource "auth0_tenant" "tenant" {
      + allow_organization_name_in_authentication_api = false
      + allowed_logout_urls                           = []
      + customize_mfa_in_postlogin_action             = false
      + default_audience                              = (known after apply)
      + default_directory                             = (known after apply)
      + default_redirection_uri                       = (known after apply)
      + enabled_locales                               = [
          + "en",
        ]
      + friendly_name                                 = (known after apply)
      + id                                            = (known after apply)
      + idle_session_lifetime                         = 72
      + picture_url                                   = (known after apply)
      + sandbox_version                               = "12"
      + session_lifetime                              = 168
      + support_email                                 = (known after apply)
      + support_url                                   = (known after apply)

      + flags {
          + allow_legacy_delegation_grant_types    = false
          + allow_legacy_ro_grant_types            = false
          + allow_legacy_tokeninfo_endpoint        = false
          + dashboard_insights_view                = false
          + dashboard_log_streams_next             = false
          + disable_clickjack_protection_headers   = false
          + disable_fields_map_fix                 = false
          + disable_management_api_sms_obfuscation = false
          + enable_adfs_waad_email_verification    = false
          + enable_apis_section                    = false
          + enable_client_connections              = false
          + enable_custom_domain_in_emails         = false
          + enable_dynamic_client_registration     = false
          + enable_idtoken_api2                    = false
          + enable_legacy_logs_search_v2           = false
          + enable_legacy_profile                  = false
          + enable_pipeline2                       = false
          + enable_public_signup_user_exists_error = false
          + mfa_show_factor_list_on_enrollment     = false
          + no_disclose_enterprise_connections     = false
          + require_pushed_authorization_requests  = false
          + revoke_refresh_token_grant             = false
          + use_scope_descriptions_for_consent     = false
        }

      + session_cookie {}

      + sessions {
          + oidc_logout_prompt_enabled = false
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```